tests/auto_build/testcases/output/MinOccursIsZeroRequest.out

POST /XSD_string/services/XSD_stringSOAP HTTP/1.1
Host: localhost:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "http://tempuri.org/MinOccursIsZero/NewOperation"
Content-Length: 652

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:optionalElements xmlns:ns1="http://tempuri.org/MinOccursIsZero/">
<stringElement>Hello!</stringElement>
<integerElement>123</integerElement>
<complexType><stringElement>Goodbye!</stringElement>
<integerElement>234</integerElement>
<complexType><stringElement>Welcome!</stringElement>
<integerElement>345</integerElement>
</complexType></complexType>
</ns1:optionalElements>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

POST /XSD_string/services/XSD_stringSOAP HTTP/1.1
Host: localhost:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "http://tempuri.org/MinOccursIsZero/NewOperation"
Content-Length: 471

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:optionalElements xmlns:ns1="http://tempuri.org/MinOccursIsZero/">
<stringElement>Hello!</stringElement>
<integerElement>123</integerElement>
<complexType></complexType>
</ns1:optionalElements>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

POST /XSD_string/services/XSD_stringSOAP HTTP/1.1
Host: localhost:13260
Content-Type: text/xml; charset=UTF-8
SOAPAction: "http://tempuri.org/MinOccursIsZero/NewOperation"
Content-Length: 368

<?xml version='1.0' encoding='utf-8' ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<SOAP-ENV:Body>
<ns1:optionalElements xmlns:ns1="http://tempuri.org/MinOccursIsZero/">
</ns1:optionalElements>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>

